blog/app/views/posts/edit.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %>
    <%= f.collection_select :category_id, Category.all, :id, :name %>