blog/app/views/posts/new.html.erb

    <%= f.label :category %>
    <%= f.collection_select :category_id, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"