blog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "updated_at", "post_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdasd"], ["created_at", "2017-07-22 01:19:22.495450"], ["updated_at", "2017-07-22 01:19:22.495450"], ["post_id", 7], ["user_id", 4]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])