blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    :authenticate_user!
    @post = Post.new(post_params)
    @post.user = current_user
    @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "category_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update

    if @post.update post_params
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Adipisicing magna dolorem omnis ratione harum voluptatem Culpa aperiam enim officia culpa quia quia"], ["updated_at", "2017-07-15 00:09:38.651707"], ["id", 3]]