blog/app/controllers/users_controller.rb

def create
  @user = User.new user_params
  if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

def update
  @user = User.find(params[:id])
  if @user.update user_params_edit
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Tdsogfj"], ["last_name", "abdfbgdfrg"], ["updated_at", "2017-07-22 01:09:57.894143"], ["id", 4]]